In [11]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [12]:
df["Category"] = ["A","B","C","A","B"]
df["Gender"] = ["F","M","F","M","F"]

In [13]:
df["Sales"] = [100,200,300,400,500]
df

      Name  Age Category Gender  Sales
0    Alice   25        A      F    100
1      Bob   30        B      M    200
2  Charlie   35        C      F    300
3    David   40        A      M    400
4      Eve   45        B      F    500

In [14]:
# クロス集計表
crosstab = pd.crosstab(df["Category"],df["Gender"])
crosstab

Gender    F  M
Category
A         1  1
B         1  1
C         1  0